// Created by Github@TrialNeo(shenpanpro@gmail.com) 
// Created Time 2026/3/20.

#include "menu.h"
#include <stdio.h>


//菜单页 提示登录
void menu_login() {

}

//输出欢迎页菜单
void menu_welcome() {
    puts("+============================================");
    puts("+ \t欢迎使用个人物品管理小应用");
    puts("+============================================");
    puts("+ 1.查询个人物品  \t+ 2.录入个人物品信息");
    puts("+--------------------------------------------");
    puts("+ 3.修改个人物品信息\t+ 4.删除个人物品信息");
    puts("+--------------------------------------------");
    puts("+ 5.物品转赠\t\t+ 0.退出系统\t");
    puts("+============================================");

}


